pesp-jboss/cms-external-sources/tests/test_files/soap/SAM_doSearch_byPartialName_req.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:impl="http://impl.services.screening.medicaid.gov/">
   <soapenv:Header/>
   <soapenv:Body>
      <impl:doSearch>
         <!--Optional:-->
         <arg0>
            <!--Optional:-->
            <classification/>
            <!--Optional:-->
            <firstName/>
            <!--Optional:-->
            <lastName/>
            <!--Optional:-->
            <middleName/>
            <!--Optional:-->
            <partialName>ABU</partialName>
         </arg0>
      </impl:doSearch>
   </soapenv:Body>
</soapenv:Envelope>